# To change this license header, choose License Headers in Project Properties.
# To change this template file, choose Tools | Templates
# and open the template in the editor.
professor.obrigatorio \u00c9 necess\u00e1rio informar o professor da quest\u00e3o.

questao.enunciado.obrigatorio O enunciado da quest\u00e3o \u00e9 obrigat\u00f3rio.
questao.enunciado.repetido J\u00e1 existe uma quest\u00e3o com este enunciado.
questao.tipo.obrigatorio O tipo da quest\u00e3o \u00e9 obrigat\u00f3rio.
questao.tamanho.enunciado O tamanho do enunciado \u00e9 maior do que o m\u00e1ximo permitido.
questao.alternativa.obrigatorio A alternativa da quest\u00e3o \u00e9 obrigat\u00f3ria.
questao.alternativa.obrigatorias O preenchimento das alternativas \u00e9 obrigat\u00f3rio.
questao.alternativas.iguais Existem alternativas iguais. Favor revisar a quest\u00e3o.
questao.resposta.obrigatoria A resposta da quest\u00e3o deve ser selecionada.

selecione.uma.questao Selecione ao menos uma quest\u00e3o.

alternativa.tamanho.maximo O tamanho da alternativa \u00e9 maior do que o m\u00e1ximo permitido.

componente.curricular.obrigatorio \u00c9 necess\u00e1rio informar um componente curricular.
componente.curricular.nome.obrigatorio O nome do componente curricular \u00e9 obrigat\u00f3rio.
componente.curricular.nome.duplicado O componente curricular j\u00e1 existe.
componente.curricular.tamanho.nome O tamanho do nome \u00e9 maior do que o m\u00e1ximo permitido.

simulado.titulo.obrigatorio O t\u00edtulo do simulado \u00e9 obrigat\u00f3rio.
titulo.tamanho.maximo O tamanho do t\u00edtulo \u00e9 maior do que o m\u00e1ximo permitido.
simulado.titulo.duplicado O t\u00edtulo do simulado j\u00e1 est\u00e1 em uso.
simulado.questoes.obrigatorias Responda todas as quest\u00f5es antes de finalizar o simulado.

prova.titulo.obrigatorio O t\u00edtulo da prova \u00e9 obrigat\u00f3rio.
prova.questoes.minimas A prova deve ter ao menos duas quest\u00f5es.
prova.data.criacao.obrigatoria A data de cria\u00e7\u00e3o \u00e9 obrigat\u00f3ria.
prova.data.hora.inicio.obrigatoria A data e hora de \u00ednicio \u00e9 obrigat\u00f3ria.
prova.data.hora.fim.obrigatoria A data e hora de t\u00e9rmino \u00e9 obrigat\u00f3ria.
prova.duracao.obrigatoria A dura\u00e7\u00e3o m\u00e1xima da prova \u00e9 obrigat\u00f3ria.
prova.data.inicio.maior.data.fim A data de \u00ednicio da prova n\u00e3o pode ser maior que a data de t\u00e9rmino.
prova.disponibilidade.minima A prova deve ficar dispon\u00edvel por ao menos 30 minutos.
prova.disponibilidade.maxima A prova deve ficar dispon\u00edvel por no m\u00e1ximo 5 horas.
prova.data.inicia.anterior.data.atual A data de \u00ednicio da prova n\u00e3o pode ser menor que a data e hora atual.

questao.obrigatoria A quest\u00e3o \u00e9 obrigat\u00f3ria.
aluno.obrigatorio O aluno \u00e9 obrigat\u00f3rio.
prova.obrigatoria A prova \u00e9 obrigat\u00f3ria.
prova.nota.obrigatoria A nota da prova \u00e9 obrigat\u00f3ria.

simulado.obrigatorio O simulado \u00e9 obrigat\u00f3rio.